vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM34Z7_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs='http://www.w3.org/2001/XMLSchema-instance' xs:noNamespaceSchemaLocation='PACK.xsd' schemaVersion='1.4'>
  <name>MKM34Z7_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKM34Z7</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version='25.06.00' date='2025-06-24'>NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version='25.03.00' date='2025-03-28'>NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version='19.0.0' date='2024-07-17'>NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version='18.0.0' date='2024-01-14'>NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version='17.0.0' date='2023-07-27'>NXP CMSIS Packs based on MCUXpresso SDK 2.14.0</release>
    <release version='16.0.0' date='2023-01-16'>NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version='15.0.0' date='2022-07-13'>NXP CMSIS Packs based on MCUXpresso SDK 2.12.0</release>
    <release version='14.0.0' date='2022-01-05'>NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version='13.0.0' date='2021-07-13'>NXP CMSIS Packs based on MCUXpresso SDK 2.10.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name='CMSIS' vendor='ARM' version='6.1.0'/>
    </packages>
    <languages>
      <language name='C' version='99'/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily='MKM34Z7' Dvendor='NXP:11'>
      <description>
        KM3x: Kinetis KM3x-50–75 MHz Precision Metrology with Segment LCD MCUs based on ARM® Cortex®-M0+
      </description>
      <device Dname='MKM34Z256xxx7'>
        <processor Dcore='Cortex-M0+' Dfpu='NO_FPU' Dmpu='NO_MPU' Dendian='Little-endian' Dclock='75000000'/>
        <environment name='iar'>
          <file category='linkerfile' name='devices/MKM34Z7/iar/MKM34Z256xxx7_flash.icf'/>
        </environment>
        <memory name='PROGRAM_FLASH' start='0x00000000' size='0x040000' access='rx' default='1' startup='1'/>
        <memory name='SRAM' start='0x1fffe000' size='0x8000' access='rw' default='1'/>
        <algorithm name='devices/MKM34Z7/arm/MKMP256_2KB.FLM' start='0x00000000' size='0x00040000' RAMstart='0x20000000' RAMsize='0x00001000' default='1'/>
        <debug svd='devices/MKM34Z7/MKM34Z7.xml'/>
        <variant Dvariant='MKM34Z256VLQ7'>
          <compile header='devices/MKM34Z7/fsl_device_registers.h' define='CPU_MKM34Z256VLQ7'/>
        </variant>
        <variant Dvariant='MKM34Z256VLL7'>
          <compile header='devices/MKM34Z7/fsl_device_registers.h' define='CPU_MKM34Z256VLL7'/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id='device.MKM34Z7.internal_condition'>
      <accept Dname='MKM34Z256VLL7' Dvendor='NXP:11'/>
      <accept Dname='MKM34Z256VLQ7' Dvendor='NXP:11'/>
    </condition>
    <condition id='cmake_toolchain.condition_id'>
      <require condition='allOf.device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.device=MKM34Z7.internal_condition'>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='component.Legacy_flash_adapter.condition_id'>
      <require condition='allOf.driver.flash, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flash, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flash'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='component.cmsis_drivers.condition_id'>
      <require condition='allOf.device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='component.flash_adapter.condition_id'>
      <require condition='allOf.anyOf=allOf=component.Legacy_flash_adapter, driver.flash, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.Legacy_flash_adapter, driver.flash, device=MKM34Z7.internal_condition'>
      <require condition='anyOf.allOf=component.Legacy_flash_adapter, driver.flash.internal_condition'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.Legacy_flash_adapter, driver.flash.internal_condition'>
      <accept condition='allOf.component.Legacy_flash_adapter, driver.flash.internal_condition'/>
    </condition>
    <condition id='allOf.component.Legacy_flash_adapter, driver.flash.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='Legacy_flash_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flash'/>
    </condition>
    <condition id='component.lists.condition_id'>
      <require condition='allOf.driver.common, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='component.log.condition_id'>
      <require condition='allOf.driver.common, utility.str, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, utility.str, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='component.log.backend.debug_console.condition_id'>
      <require condition='allOf.component.log, driver.common, utility.debug_console, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, utility.debug_console, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='component.log.backend.debug_console_lite.condition_id'>
      <require condition='allOf.component.log, driver.common, utility.debug_console_lite, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, utility.debug_console_lite, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='component.log.backend.ringbuffer.condition_id'>
      <require condition='allOf.component.log, driver.common, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='component.lptmr_adapter.condition_id'>
      <require condition='allOf.driver.lptmr, device=MKM34Z7.internal_condition'/>
    </condition>
