vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM34Z7_DFP.pdsc
    <condition id='driver.dmamux.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.ewm.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.flash.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.gpio.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.i2c.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.i2c_dma.condition_id'>
      <require condition='allOf.driver.dma, driver.i2c, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.dma, driver.i2c, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.i2c_edma.condition_id'>
      <require condition='allOf.driver.i2c, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.i2c, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.irtc.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.llwu.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.lptmr.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.lpuart.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.lpuart_dma.condition_id'>
      <require condition='allOf.driver.dma, driver.lpuart, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.dma, driver.lpuart, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.mmau.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.pdb.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.pit.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.pmc.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.port.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.qtmr_2.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.rcm.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.rnga.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.sim.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.slcd.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.slcd_engine.condition_id'>
      <require condition='allOf.anyOf=driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010, device=MKM34Z7.internal_condition'>
      <require condition='anyOf.driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010.internal_condition'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_ftp12557'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_gdh_1247wp'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_lcd_s401m16kr'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_od_6010'/>
    </condition>
    <condition id='driver.slcd_ftp12557.condition_id'>
      <require condition='allOf.driver.slcd_engine, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.slcd_engine, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_engine'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.slcd_gdh_1247wp.condition_id'>
      <require condition='allOf.driver.slcd_engine, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.slcd_lcd_s401m16kr.condition_id'>
      <require condition='allOf.driver.slcd_engine, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.slcd_od_6010.condition_id'>
      <require condition='allOf.driver.slcd_engine, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.smc.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.spi.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.spi_dma.condition_id'>
      <require condition='allOf.driver.dma, driver.spi, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.dma, driver.spi, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='spi'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.sysmpu.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.uart.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
    <condition id='driver.uart_dma.condition_id'>
      <require condition='allOf.driver.dma, driver.uart, device=MKM34Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.dma, driver.uart, device=MKM34Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
      <require condition='device.MKM34Z7.internal_condition'/>
    </condition>
    <condition id='driver.vref.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM34Z256xxx7.internal_condition'/>
    </condition>
