vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM34Z7_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_swo' Cversion='1.0.0' condition='component.serial_manager_swo.condition_id'>
      <description>Component serial_manager_swo</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_swo.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_swo.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart' Cversion='1.0.0' condition='component.serial_manager_uart.condition_id'>
      <description>Component serial_manager_uart</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_uart.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_uart.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_virtual' Cversion='1.0.0' condition='component.serial_manager_virtual.condition_id'>
      <description>Component serial_manager_virtual</description>
      <RTE_Components_h>
        #ifndef SSERIAL_PORT_TYPE_VIRTUAL
        #define SSERIAL_PORT_TYPE_VIRTUAL 1
        #endif
        #ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 1
        #endif
      </RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_virtual.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_virtual.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='uart_adapter' Cversion='1.0.0' condition='component.uart_adapter.condition_id'>
      <description>Component uart_adapter</description>
      <files>
        <file category='header' name='components/uart/fsl_adapter_uart.h' projectpath='component/uart'/>
        <file category='sourceC' name='components/uart/fsl_adapter_uart.c' projectpath='component/uart'/>
        <file category='include' name='components/uart/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MKM34Z7_header' Cversion='1.0.0' condition='device.CMSIS.condition_id'>
      <description>Device MKM34Z7_cmsis</description>
      <files>
        <file category='header' name='devices/MKM34Z7/fsl_device_registers.h' projectpath='device'/>
        <file category='header' name='devices/MKM34Z7/MKM34Z7.h' projectpath='device'/>
        <file category='header' name='devices/MKM34Z7/MKM34Z7_features.h' projectpath='device'/>
        <file category='header' name='devices/MKM34Z7/MKM34Z7_COMMON.h' projectpath='device'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_ADC.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_AFE.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_AIPS.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_CAU.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_CMP.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_CRC.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_DMA.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_DMAMUX.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_EWM.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_FGPIO.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_FTFA.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_GPIO.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_I2C.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_LCD.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_LLWU.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_LPTMR.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_LPUART.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_MCG.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_MCM.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_MMAU.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_MTB.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_MTBDWT.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_NV.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_OSC.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_PDB.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_PIT.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_PMC.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_PORT.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_RCM.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_RNG.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_ROM.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_RTC.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_SIM.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_SMC.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_SPI.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_SYSMPU.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_TMR.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_UART.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_VREF.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_WDOG.h' projectpath='device/periph1'/>
        <file category='header' name='devices/MKM34Z7/periph1/PERI_XBAR.h' projectpath='device/periph1'/>
        <file category='include' name='devices/MKM34Z7/'/>
        <file category='include' name='devices/MKM34Z7/periph1/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device' Cversion='1.0.0' condition='device.RTE.condition_id'>
      <description>Rte_device</description>
      <files>
        <file category='header' attr='config' name='devices/MKM34Z7/template/RTE_Device.h' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MKM34Z7/template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='MKM34Z7_linker' Cversion='1.0.0' condition='device.linker.condition_id'>
      <description>Device MKM34Z7_linker</description>
      <files>
        <file condition='allOf.toolchains=mdk, device_ids=MKM34Z256xxx7.condition_id' category='linkerScript' attr='config' name='devices/MKM34Z7/arm/MKM34Z256xxx7_flash.scf' version='1.0.0' projectpath='MKM34Z7/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MKM34Z256xxx7.condition_id' category='linkerScript' attr='config' name='devices/MKM34Z7/arm/MKM34Z256xxx7_ram.scf' version='1.0.0' projectpath='MKM34Z7/arm'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MKM34Z256xxx7.condition_id' category='linkerScript' attr='config' name='devices/MKM34Z7/gcc/MKM34Z256xxx7_flash.ld' version='1.0.0' projectpath='MKM34Z7/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MKM34Z256xxx7.condition_id' category='linkerScript' attr='config' name='devices/MKM34Z7/gcc/MKM34Z256xxx7_ram.ld' version='1.0.0' projectpath='MKM34Z7/gcc'/>
        <file condition='allOf.toolchains=iar, device_ids=MKM34Z256xxx7.condition_id' category='linkerScript' attr='config' name='devices/MKM34Z7/iar/MKM34Z256xxx7_flash.icf' version='1.0.0' projectpath='MKM34Z7/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MKM34Z256xxx7.condition_id' category='linkerScript' attr='config' name='devices/MKM34Z7/iar/MKM34Z256xxx7_ram.icf' version='1.0.0' projectpath='MKM34Z7/iar'/>
      </files>
    </component>
    <component Cclass='Board Support' Cgroup='SDK Project Template' Csub='project_template' Cvariant='MKM34Z7' Cversion='1.0.0' condition='device.project_template.condition_id' isDefaultVariant='1'>
      <description>Devices_project_template MKM34Z7</description>
      <files>
        <file category='header' attr='config' name='devices/MKM34Z7/project_template/board.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MKM34Z7/project_template/board.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MKM34Z7/project_template/clock_config.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MKM34Z7/project_template/clock_config.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MKM34Z7/project_template/pin_mux.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MKM34Z7/project_template/pin_mux.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MKM34Z7/project_template/peripherals.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MKM34Z7/project_template/peripherals.c' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MKM34Z7/project_template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='Startup' Csub='' Cversion='1.0.0' condition='device.startup.condition_id'>
      <description>Device MKM34Z7_startup</description>
      <files>
        <file condition='allOf.toolchains=iar.condition_id' category='sourceAsm' attr='config' name='devices/MKM34Z7/iar/startup_MKM34Z7.s' version='1.0.0' projectpath='startup/iar'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceAsm' attr='config' name='devices/MKM34Z7/gcc/startup_MKM34Z7.S' version='1.0.0' projectpath='startup/gcc'/>
        <file condition='allOf.toolchains=mdk.condition_id' category='sourceAsm' attr='config' name='devices/MKM34Z7/arm/startup_MKM34Z7.S' version='1.0.0' projectpath='startup/arm'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MKM34Z7_system' Cversion='1.0.0' condition='device.system.condition_id'>
      <description>Device MKM34Z7_system</description>
      <files>
        <file category='sourceC' name='devices/MKM34Z7/system_MKM34Z7.c' projectpath='device'/>
        <file category='header' name='devices/MKM34Z7/system_MKM34Z7.h' projectpath='device'/>
        <file category='include' name='devices/MKM34Z7/'/>
      </files>
    </component>
