vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM34Z7_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='adc' Cversion='2.3.0' condition='driver.adc16.condition_id'>
      <description>ADC16 Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_adc16.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_adc16.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='afe' Cversion='2.0.3' condition='driver.afe.condition_id'>
      <description>AFE Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_afe.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_afe.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='clock' Cversion='2.5.1' condition='driver.clock.condition_id'>
      <description>Clock Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_clock.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_clock.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='cmp' Cversion='2.0.3' condition='driver.cmp.condition_id'>
      <description>CMP Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_cmp.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_cmp.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='I2C' Csub='i2c_cmsis' Cversion='2.2.0' Capiversion='2.3.0' condition='driver.cmsis_i2c.condition_id'>
      <description>I2C CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/cmsis_drivers/fsl_i2c_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/cmsis_drivers/fsl_i2c_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='SPI' Csub='spi_cmsis' Cversion='2.3.0' Capiversion='2.2.0' condition='driver.cmsis_spi.condition_id'>
      <description>SPI CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/cmsis_drivers/fsl_spi_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/cmsis_drivers/fsl_spi_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='USART' Csub='uart_cmsis' Cversion='2.2.0' Capiversion='2.3.0' condition='driver.cmsis_uart.condition_id'>
      <description>UART CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/cmsis_drivers/fsl_uart_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/cmsis_drivers/fsl_uart_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='common' Cversion='2.6.0' condition='driver.common.condition_id'>
      <description>common Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_common.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_common.c' projectpath='drivers'/>
        <file condition='allOf.cores=cm0p.condition_id' category='sourceC' name='devices/MKM34Z7/drivers/fsl_common_arm.c' projectpath='drivers'/>
        <file condition='allOf.cores=cm0p.condition_id' category='header' name='devices/MKM34Z7/drivers/fsl_common_arm.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='crc' Cversion='2.0.4' condition='driver.crc.condition_id'>
      <description>CRC Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_crc.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_crc.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='dma' Cversion='2.1.2' condition='driver.dma.condition_id'>
      <description>DMA Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_dma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_dma.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='dmamux' Cversion='2.1.2' condition='driver.dmamux.condition_id'>
      <description>DMAMUX Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_dmamux.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_dmamux.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ewm' Cversion='2.0.4' condition='driver.ewm.condition_id'>
      <description>EWM Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_ewm.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_ewm.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash' Cversion='3.1.3' condition='driver.flash.condition_id'>
      <description>Flash Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_ftfx_adapter.h' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_ftfx_utilities.h' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_ftfx_features.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_ftfx_controller.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_ftfx_controller.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_ftfx_flash.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_ftfx_flash.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_ftfx_cache.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_ftfx_cache.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_ftfx_flexnvm.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_ftfx_flexnvm.h' projectpath='drivers'/>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_flash.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='gpio' Cversion='2.8.2' condition='driver.gpio.condition_id'>
      <description>GPIO Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_gpio.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_gpio.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c' Cversion='2.0.9' condition='driver.i2c.condition_id'>
      <description>I2C Driver</description>
      <files>
        <file category='header' name='devices/MKM34Z7/drivers/fsl_i2c.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM34Z7/drivers/fsl_i2c.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM34Z7/drivers/'/>
      </files>
    </component>
